{
  "answeredQuestions": [
    "What does `null` represent in JavaScript?",
    "What does CSS stand for?",
    "What is the output of `console.log('5' - 2)`?",
    "What property is used to change the font size in CSS?",
    "Which tag is used for headers?",
    "What is the correct syntax for a for loop in JavaScript?",
    "What does the <a> tag define?",
    "Which data type is used to store text?",
    "Which tag is used for line breaks?",
    "How do you apply a CSS style to an HTML element?",
    "What does the `Array.isArray()` method do?",
    "What is the result of `true + 1`?",
    "How do you access the first element of an array named 'myArray'?",
    "Which method is used to add an item to the end of an array?",
    "Which method removes the last item from an array?",
    "What does the <meta> tag provide?",
    "Which tag is used for creating a table?",
    "How do you define a form in HTML?",
    "What does HTML stand for?",
    "How do you make text bold in HTML?",
    "What does 'JS' stand for?",
    "What is the keyword to declare a constant variable?",
    "What will `typeof 10` return?",
    "Which symbol is used for comments in JavaScript?",
    "Which operator is used to compare two values for equality?",
    "How do you define a function in JavaScript?",
    "What is the purpose of the <meta charset='UTF-8'> tag?",
    "What does the <style> tag define in HTML?",
    "Which tag is used to create a numbered list?",
    "Which tag is used to create a hyperlink?",
    "Which HTML attribute specifies an alternate text for an image if the image cannot be displayed?",
    "How do you define a block of code in HTML?",
    "What is the correct HTML element for the largest heading?",
    "What does the <iframe> tag do in HTML?",
    "Which tag is used to group block elements in HTML?",
    "What is the correct HTML element for an unordered list?",
    "What is the output of `typeof NaN`?",
    "What is the purpose of the `filter()` method in arrays?",
    "What does `Object.keys()` return?",
    "What is the result of `false + 1`?",
    "What is a callback function?",
    "Which tag is used to define a table header cell?",
    "What does the <nav> tag represent in HTML?",
    "How do you specify a CSS file in HTML?",
    "What is the purpose of the <script> tag in HTML?",
    "What is the output of `typeof []`?",
    "What is the difference between `==` and `===` in JavaScript?",
    "How does JavaScript handle asynchronous operations?",
    "What does the `reduce()` method do in arrays?",
    "What is a closure?",
    "What is the output of `console.log(0.1 + 0.2 === 0.3)`?",
    "What does 'use strict' do in JavaScript?",
    "What is the purpose of the `bind()` method in JavaScript?",
    "What is a prototype in JavaScript?",
    "What is the `async` keyword used for in JavaScript?",
    "What is event delegation in JavaScript?",
    "What does `Object.freeze()` do?",
    "What is an IIFE (Immediately Invoked Function Expression)?",
    "What is a promise in JavaScript?",
    "What is the correct HTML element for inserting an image?",
    "Which property is used to set the background color in CSS?",
    "Which tag is used to define the main content of the document?",
    "Which tag is used to create a list item?",
    "What property is used to control the visibility of an element?",
    "What does the <footer> tag represent?",
    "What is the correct HTML element for inserting a line break?",
    "How do you center a block element in CSS?",
    "How do you apply multiple CSS classes to an element?",
    "What is the purpose of the <title> tag?",
    "What is the purpose of the `map()` method in arrays?",
    "What is the correct syntax to declare a variable?",
    "What does the `this` keyword refer to in a method?",
    "What does `parseFloat()` do in JavaScript?",
    "How do you check if an object has a specific property?",
    "Which function is used to convert a string to an integer?",
    "What is the result of 2 + '2' in JavaScript?",
    "How do you create an array in JavaScript?",
    "Which method removes the first item from an array?",
    "How do you concatenate two strings in JavaScript?",
    "How do you link a CSS file to an HTML document?",
    "How do you select an element with a specific id in CSS?",
    "What property is used to change the text color in CSS?"
  ],
  "score": 190
}